content/blog/office-hours.md
+++
title = "Office hours"
author = ["Rakhim Davletkaliyev"]
date = 2019-05-21T12:45:00+03:00
draft = false
creator = "Emacs 26.2 (Org mode 9.1.9 + ox-hugo)"
+++

As an experiment, I am holding paid office hours for several weeks. I'd love to share whatever limited experience I've gained so far. You can schedule a 30 or 60 minute audio call to talk (in English or Russian) about any of the following topics:

1.  **Computer science and programming**.
    -   Discuss a fascinating idea.
    -   Feeling lost and want to understand something.
    -   No code review or debugging. Consider hiring a private mentor (on sites like codementor.io) for that.

2.  **Software development career**. I have experience being hired and hiring developers, being managed and managing teams, working on client projects, freelancing and on my own private businesses.
    -   How to chose what to learn and where to work.
    -   Freelancing vs. full time work.
    -   How to grow professionally.
    -   How to get promoted.

3.  **Professional immigration**. I've been through several work-, education- and entrepreneurship-based immigration processes in Canada (Federal and Quebec) and Finland.
    -   How to chose a country that suits you and your family.
    -   North America vs. Europe
    -   English exams
    -   Preparation, process, first steps after landing.

4.  **Entrepreneurship and startups**.
    -   Starting your own business.
    -   Raising funds.
    -   Growth, goals and metrics.

5.  **Education and/or immigration**.
    -   Learning English.
    -   What to study in college.
    -   How to study abroad. Scholarships, immigration, work after graduation.

6.  **Self management**.
    -   Getting things done
    -   Focusing on hard tasks
    -   Managing distractions
    -   Reducing mindless browsing, social media influence, digital addictions

7.  Other:
    -   simplifying life
    -   digital essentialism
    -   managing complexity in life
    -   public speaking
    -   podcasting
    -   blogging
    -   ... and almost anything else :)

Book your meeting at [calendly.com/rakhim](https://calendly.com/rakhim). Payment is processed there, along with the booking. Email me at [contact@rakhim.org](mailto:contact@rakhim.org) if you have any questions.

UPD (2.7.2019): the office hours experiments is concluded. Thank you!


## Testimonials {#testimonials}

_I had a chat with Rakhim about education and mindfulness. His broad vision and aspiration to immerse in the asked questions helped me validate my current knowledge and gave me the direction for further growth. I recommend office hours if you feel kind of lost in a topic and want to know where to move on._ — **Andrew R**.

_One hour Q&A session had helped me to better determine my career goals and new ways to fulfill my interests in different areas of software engineering. Thanks to Rakhim, I've found new opportunities and ideas on how to improve my computer science knowledge, English, and other things. Thank you bro!_ — **Rustem Z.**

_Me and Rakhim were talking about doing business in Finland. We had just 30 minutes, but we managed to discuss visa, tax and legal aspects of working in Finland. Rakhim also sent me a bunch of useful links after the chat. It was a nice experience overall, can totally recommend._ — **Dmitry N.**
